package com.ancun.xinhu.domain.dto;

/**
 *返回信息枚举 
 * <p>
 * create at 2014年10月28日 下午5:15:54
 * @author <a href="mailto:caozhenfei@ancun.com">Dim.Cao</a>
 * @version %I%, %G%
 * @see
 */
public enum XinHuResponseCode {
	 /**成功*/
	_1000000(1000000,"成功"),
	 /**系统维护中*/
	_100001(100001,"系统维护中"),
	/**系统忙，请稍候再试*/
	_100002(100002,"系统忙，请稍候再试"),
	/**接口协议错误*/
	_100003(100003,"接口协议错误"),
	/**数据异常*/
	_100004(100004,"数据异常"),
	/**未知错误*/
	_100005(100005,"未知错误"),
	/**保全信息异常*/
	_100006(100006,"保全信息异常"),
	/**查询信息异常*/
	_100007(100007,"查询信息异常"),
	/**请求的HTTPMETHOD不支持*/
	_110001(110001,"请求的HTTPMETHOD不支持"),
	/**请求内容不能为空*/
	_110002(110002,"请求内容不能为空"),
	/**请求内容长度超过限制*/
	_110003(110003,"请求内容长度超过限制"),
	/**接入者Key不正确*/
	_110004(110004,"接入者Key不正确"),
	/**请求内容异常*/
	_110005(110005,"请求内容异常"),
	/**请求返回内容格式暂不支持*/
	_110006(110006,"请求返回内容格式暂不支持"),
	/**求返回内容格式不正确*/
	_110007(110007,"请求返回内容格式不正确"),
	/**接入者密钥不正确*/
	_110008(110008,"接入者密钥不正确"),
	/**IP受限，禁止访问*/
	_110010(110010,"IP受限，禁止访问"),
	/**接口维护中*/
	_110011(110011,"接口维护中"),
	/**请求时间不能为空*/
	_110012(110012,"请求时间不能为空"),
	/**请求时间格式不正确*/
	_110013(110013,"请求时间格式不正确"),
	/**请求时间无效*/
	_110014(110014,"请求时间无效"),
	/**暂不支持该服务*/
	_110015(110015,"暂不支持该服务"),
	/**接口未定义*/
	_110016(110016,"接口未定义"),
	/**签名不能为空*/
	_110017(110017,"签名不能为空"),
	/**签名不正确*/
	_110018(110018,"签名不正确"),
	/**签名不匹配*/
	_110019(110019,"签名不匹配"),
	/**请求内容长度不能为空*/
	_110020(110020,"请求内容长度不能为空"),
	/**请求内容长度格式不正确*/
	_110021(110021,"请求内容长度格式不正确"),
	/**请求内容长度不匹配*/
	_110022(110022,"请求内容长度不匹"),
	/**该接口暂不可用*/
	_110027(110027,"该接口暂不可用"),
	/**该接口已不可用*/
	_110028(110028,"该接口已不可用"),
	/**该接口暂不开放*/
	_110029(110029,"该接口暂不开放"),
	/**参数不能为空*/
	_110030(110030,"参数不能为空"),
	/**参数不正确*/
	_110031(110031,"参数不正确"),
	/**参数输入有误*/
	_110032(110032,"参数输入有误"),
	/**该参数尚未启用*/
	_110033(110033,"该参数尚未启用"),
	/**权限不足，禁止访问*/
	_110034(110034,"权限不足，禁止访问"),
	/**非法操作，禁止访问*/
	_110039(110039,"非法操作，禁止访问"),
	/**系统设置错误*/
	_110040(110040,"系统设置错误"),
	/**暂无记录*/
	_110042(110042,"暂无记录"),
	/**记录不存在*/
	_110043(110043,"记录不存在"),
	/**记录获取失败*/
	_110044(110044,"记录获取失败"),
	/**记录异常*/
	_110045(110045,"记录异常"),
	/**请求过于频繁*/
	_110046(110046,"请求过于频繁"),
	
	/**记录异常*/
	_120000(120000,"用户名或密码错误"),
	/**验证码错误*/
	_120001(120001,"验证码错误"),
	/**账号已存在*/
	_120002(120002,"账号已存在"),
	/**旧密码错误*/
	_120003(120003,"旧密码错误"),
	/**账号已存在*/
	_120004(120004,"账号不存在"),
	/**不可以给自己递交自己的名片*/
	_120005(120005,"不可以给自己递交自己的名片"),
	/**已经是好友关系*/
	_120006(120006,"已经是好友关系"),
	/**已经递交名片（还未通过）*/
	_120007(120007,"您已递交名片，请等待验证"),
	/**对方已递交名片，请您接收对方名片*/
	_120008(120008,"对方已递交名片，请您接收对方名片"),
	/**该企业信息已被注册，请检查企业名称、企业代码、登记号*/
	_120009(120009,"该企业信息已被注册，请检查企业名称、企业代码、登记号"),
	/**修改个人信息时，递交的职位大于三个*/
	_120010(120010,"修改个人信息时，递交的职位大于三个"),
	;
	
	
	
	private int code;
	private String msg;
	
	private XinHuResponseCode(int code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	public int getCode() {
		return code;
	}

	public void setCode(int code) {
		this.code = code;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}	
}
